Revit 2027 API
ElementRecord.GetOwnerViewId Method
 Gets the element id of the owner view record.
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public ElementId GetOwnerViewId()
Public Function GetOwnerViewId As ElementId
public:
ElementId^ GetOwnerViewId()
member GetOwnerViewId : unit -> ElementId
Return Value
ElementId
 The view record element id.
See Also
Reference
ElementRecord Class
Autodesk.Revit.DB Namespace